Repository: nofeletru/UsbAsp-flash
Catalog: software/lang/*.po
Languages: pt_pt

source: Установлен размер страницы кратный двум!
pt_pt: O tamanho da página tem de ser uma potência de 2

source: Установлен стандартный размер страницы
pt_pt: O tamanho da página por defeito está definido

source: Возможно включена защита на запись. Нажмите кнопку "Снять защиту" и сверьтесь с даташитом
pt_pt: Possivelmente a proteção está activa. Use "Unprotect" e verifique no datasheet

source: Изменен
pt_pt: Modificado

source: Проверьте настройки
pt_pt: Verifique as definições

source: Чип будет стерт и перезаписан. Продолжить?
pt_pt: A EEPROM vai ser apagada e programada. Deseja continuar?

source: Ошибка подключения к USBAsp
pt_pt: Erro ao conectar com o USBAsp

source: Готово
pt_pt: Feito

source: Стираю флэшку...
pt_pt: A apagar EEPROM...

source: Перейти по адресу
pt_pt: Ir para endereço

source: Микросхема не отвечает
pt_pt: A EEPROM não responde

source: (Неизвестно)
pt_pt: (Desconhecido)

source: Данная версия прошивки не поддерживает I2C и MW!
pt_pt: Este firmware não suporta I2C e MW!

source: Стало Sreg:
pt_pt: Novo SREG:

source: Используется программатор:
pt_pt: Programador actual:

source: Значение не найдено
pt_pt: Valor não encontrado

source: Данная версия прошивки не поддерживается!
pt_pt: Este firmware não suporta programação de EEPROM

source: Было Sreg:
pt_pt: Antigo SREG:

source: Читаю флэшку...
pt_pt: A ler EEPROM...

source: Поиск HEX значения
pt_pt: Procurar valor HEX

source: Ошибка установки скорости SPI
pt_pt: Erro ao definir a velocidade do SPI

source: Размер:
pt_pt: Tamanho:

source: Укажите шестнадцатеричные числа
pt_pt: Use números HEX

source: Точно стереть чип?
pt_pt: Apagar EEPROM?

source: Начать запись?
pt_pt: Iniciar programação?

source: Время выполнения:
pt_pt: Tempo de execução:

source: USB_control_msg отвалился по таймауту!
pt_pt: USB_control_msg passou do tempo limite!

source: Прервано пользователем
pt_pt: Cancelado pelo utilizador

source: Проверяю флэшку...
pt_pt: A verificar EEPROM...

source: Ошибка сравнения по адресу:
pt_pt: Erro de verificação no endereço:

source: Записываю флэшку...
pt_pt: A programar EEPROM... (sem verificação)

source: Записываю флэшку с проверкой...
pt_pt: A programar EEPROM... (com verificação)

source: Количество прочитанных байт не равно размеру флэшки
pt_pt: O número de bytes lidos não é igual ao tamanho da EEPROM

source: Количество записанных байт не равно размеру флэшки
pt_pt: O número de bytes escritos não é igual ao tamanho da EEPROM

source: Размер файла больше размера чипа
pt_pt: O tamanho do ficheiro é maior do que o tamanho da EEPROM

source: Процесс может длиться больше минуты на больших флешках!
pt_pt: O processo pode levar mais do que 1 minuto em EEPROMS de tamanho grande!

source: Ошибка подключения к CH341
pt_pt: Erro ao conectar com o CH341

source: Ошибка подключения к AVRISP
pt_pt: Erro ao conectar com o AVRISP

source: Программатор
pt_pt: Programador

source: Снять защиту
pt_pt: Desbloquear

source: Прервать текущею операцию
pt_pt: Cancelar

source: Стереть
pt_pt: Apagar EEPROM

source: Загрузить прошивку в редактор
pt_pt: Abrir ficheiro

source: Прочитать
pt_pt: Ler EEPROM

source: Прочитать индификатор
pt_pt: Ler ID da EEPROM

source: Сохранить прошивку из редактора
pt_pt: Guardar Ficheiro

source: Сравнить содержимое
pt_pt: Verificar EEPROM

source: Записать
pt_pt: Programar EEPROM

source: Очистить
pt_pt: Limpar log

source: Тип адресации к памяти
pt_pt: Tipo de endereço

source: Размер чипа в байтах
pt_pt: Tamanho da EEPROM em bytes

source: Снять защиту -> стереть -> записать -> проверить
pt_pt: Desbloquear -> Apagar -> Programar -> Verificar

source: Длинна адреса в битах
pt_pt: Tamanho do endereço em bits

source: Размер страницы
pt_pt: Tamanho da página

# TMAINFORM.COPYLOGMENUITEM.CAPTION
source: Копировать
pt_pt: Copiar

source: Страница
pt_pt: Página

source: Размер
pt_pt: Tamanho

source: Тип адреса
pt_pt: Tipo de endereço

source: Длина адреса
pt_pt: Tamanho do endereço

# tmainform.label3.caption
source: Микросхема:
pt_pt: EEPROM Selecionada:

source: Команды SPI
pt_pt: Comandos SPI

source: Проверка записи
pt_pt: Verificar

# TMAINFORM.MENUCHIP.CAPTION
source: Микросхема
pt_pt: EEPROM

# tmainform.menucopytoclip.caption
source: Копировать
pt_pt: Copiar

source: Поиск
pt_pt: Procurar

# tmainform.menufindchip.caption
source: Поиск
pt_pt: Procurar

source: Не писать FF
pt_pt: Não escrever FF

source: Не проверять Busy бит
pt_pt: Não verificar o busy bit

source: Поставить защиту
pt_pt: Definir bits de proteção

source: Прочитать SREG
pt_pt: Ler SREG

source: Изменить SREG
pt_pt: Editar SREG

# TMAINFORM.MENUMWCLOCK.CAPTION
source: Частота
pt_pt: Frequência

source: Настройки
pt_pt: Opções

# tmainform.menuspiclock.caption
source: Частота
pt_pt: Frequência

source: Учитывать регистр
pt_pt: Distinguir maiúsculas e minúsculas

source: Найти
pt_pt: Procurar

source: Искать сначала
pt_pt: Do início

source: Искать HEX значение
pt_pt: Procurar por valor HEX

source: Заменить все
pt_pt: Substituir Todos

source: Заменить
pt_pt: Substituir

source: заменить на:
pt_pt: substituir com:

source: Искать
pt_pt: Procurar

# TSREGEDITFORM.BUTTONREADSREG.CAPTION
source: Прочитать
pt_pt: Ler

# TSREGEDITFORM.BUTTONWRITESREG.CAPTION
source: Записать
pt_pt: Escrever

source: Поиск микросхемы
pt_pt: Encontrar EEPROM

source: Маркировка содержит:
pt_pt: A nome da EEPROM contém:

source: Выбрать микросхему
pt_pt: Selecionar EEPROM

source: Проверка на чистоту
pt_pt: Verificar se a EEPROM está vazia

# tmainform.Label_I2C_DevAddr.caption
source: Адрес устройства
pt_pt: Endereço do dispositivo

# tmainform.CheckBox_I2C_ByteRead.caption
source: Побайтовое чтение
pt_pt: Ler Byte

source: Скрипты
pt_pt: Scripts

source: Нет секции:
pt_pt: Não existe secção:

source: Выполняется секция:
pt_pt: Executar secção:

source: Выберите секцию
pt_pt: Selecionar secção

source: файл изменён
pt_pt: Ficheiro Modificado

source: Сохранить изменения?
pt_pt: Guardar alterações?

source: Используется скрипт:
pt_pt: A utilizar script:

source: Файл
pt_pt: Ficheiro

source: Открыть
pt_pt: Abrir

source: Выполнить
pt_pt: Executar

source: Сохранить
pt_pt: Guardar

source: Сохранить как...
pt_pt: Guardar Como...

source: Секция =
pt_pt: Secção =

source: Выполнить скрипт
pt_pt: Correr Script

source: Начальный адрес
pt_pt: Endereço de início
